flight-booker/app/controllers/bookings_controller.rb

	def new
		@booking = Booking.new
		@flight = Flight.find(params[:flight_id])
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

	def create
		@booking = Booking.new(booking_params)
		if @booking.save
			@booking.passengers.each do |passenger|
				PassengerMailer.thank_you(passenger).deliver_now
			end
			flash[:success] = "The flight has been booked successfully!"
			redirect_to @booking
		else
			@flight = Flight.find(params[:booking][:flight_id])
---
INSERT INTO "bookings" ("created_at", "updated_at", "flight_id") VALUES (?, ?, ?)  [["created_at", "2018-02-08 13:05:21.587981"], ["updated_at", "2018-02-08 13:05:21.587981"], ["flight_id", 20]]
SELECT "passengers".* FROM "passengers" WHERE "passengers"."booking_id" = ?  [["booking_id", 6]]
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

	def show
		@booking = Booking.find(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]