flight-booker/app/controllers/flights_controller.rb

	def index
		@airport_options = Airport.all.map { |u| [u.name, u.id] }
		@date_options = Flight.all.map { |f| f.date.strftime('%b %d, %Y') }.uniq
---
SELECT "airports".* FROM "airports"
SELECT "flights".* FROM "flights"