flight-booker/app/views/bookings/show.html.erb

SELECT "passengers".* FROM "passengers" WHERE "passengers"."booking_id" = ?  [["booking_id", 3]]
---
		<tbody>
			<% @booking.passengers.each do |passenger| %>