odin-kittens/app/controllers/kittens_controller.rb

SELECT "kittens".* FROM "kittens"
---
	def index
		@kittens = Kitten.all

SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@kitten = Kitten.find(params[:id])

INSERT INTO "kittens" ("name", "age", "cuteness", "softness", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Blanquita"], ["age", 3], ["cuteness", "high"], ["softness", "medium"], ["created_at", "2018-02-14 17:54:44.323387"], ["updated_at", "2018-02-14 17:54:44.323387"]]
---
	def create
		@kitten = Kitten.new(kitten_params)
		if @kitten.save

SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def edit
		@kitten = Kitten.find(params[:id])

SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "kittens" SET "age" = ?, "updated_at" = ? WHERE "kittens"."id" = ?  [["age", 4], ["updated_at", "2018-02-14 18:38:35.229452"], ["id", 2]]
---
	def update
		@kitten = Kitten.find(params[:id])
		if @kitten.update_attributes(kitten_params)

DELETE FROM "kittens" WHERE "kittens"."id" = ?  [["id", 2]]
SELECT  "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def destroy
		Kitten.find(params[:id]).destroy