re-former/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "marcelo"], ["email", "marcelo18@example.com"], ["password", "auto"], ["created_at", "2017-12-05 16:54:42.664883"], ["updated_at", "2017-12-05 16:54:42.664883"]]
---
	def create
		#@user = User.new(username: params[:username], email: params[:email], password: params[:password])
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Gonzalo LuL"], ["email", "gonza@example.com"], ["password", "macacoqlctmre"], ["updated_at", "2017-12-05 19:07:36.547084"], ["id", 2]]
---
	def update
		@user = User.find(params[:id])
		if @user.update(user_params)