private-events/app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@event = Event.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "events" ("location", "created_at", "updated_at", "user_id", "description") VALUES (?, ?, ?, ?, ?)  [["location", "Republica"], ["created_at", "2018-01-24 17:56:00.369921"], ["updated_at", "2018-01-24 17:56:00.369921"], ["user_id", 1], ["description", "Tremendo Krrete prrO!"]]
---
	def create
		@user = User.find(session[:user_id])
		@event = @user.events.build(event_params)
		if @event.save