private-events/app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "email") VALUES (?, ?, ?, ?)  [["name", "kaori"], ["created_at", "2018-01-22 19:27:50.044057"], ["updated_at", "2018-01-22 19:27:50.044057"], ["email", "kaochan@example.com"]]