members-only/app/controllers/posts_controller.rb

	def create
		current_user
		@post = @current_user.posts.build(title: params[:post][:title], body: params[:post][:body])

		if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Testing my new app"], ["body", "This new app is awesome dude !!!"], ["user_id", 2], ["created_at", "2018-01-11 16:06:54.663912"], ["updated_at", "2018-01-11 16:06:54.663912"]]

	def index
		@posts = Post.all
		@user = User.find_by(id: @pos)
---
SELECT "posts".* FROM "posts"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]